Repository: Leafuke/FolderRewind
Catalog: FolderRewind/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# ConfigSettingsDialog_DeleteConfirmContent
source: Delete this backup project? This action cannot be undone.
zh_cn: 确定删除该备份项目吗？此操作不可撤销。

# Config_OpenDestination_Empty
source: Destination path is empty
zh_cn: 目标路径为空

# Config_OpenDestination_NotFound
source: Destination folder not found
zh_cn: 未找到目标文件夹

# Config_Delete_CurrentConfigNull
source: Current config is null; cannot delete
zh_cn: 当前配置为空，无法删除

# Config_Delete_NotFound
source: Config not found; cannot delete
zh_cn: 未找到要删除的配置

# Config_OpenPath_Failed
source: Failed to open path: {0}
zh_cn: 打开路径失败：{0}

# ConfigSettingsDialog_ConfigName.Header
source: Config name
zh_cn: 备份项目名称

# ConfigSettingsDialog_ConfigKind.Text
source: Backup project kind
zh_cn: 备份项目种类

# ConfigSettingsDialog_ConfigKindDesc.Text
source: The kind identifies the plugin-owned capabilities used by this backup project.
zh_cn: 备份项目种类用于标识此备份项目使用的插件领域能力。

# ConfigSettingsDialog_DestPath.Text
source: Backup destination
zh_cn: 备份存储位置

# ConfigSettingsDialog_DestPathPlaceholder.PlaceholderText
source: e.g. D:\Backups
zh_cn: 例如 D:\Backups

# ConfigSettingsDialog_BrowseButton.ToolTipService.ToolTip
source: Browse folder
zh_cn: 浏览文件夹

# ConfigSettingsDialog_DestPathDesc.Text
source: Backup archives will be saved in this folder
zh_cn: 生成的备份文件将存放在此文件夹中

# ConfigSettingsDialog_OpenDestination.ToolTipService.ToolTip
source: Open destination folder
zh_cn: 打开目标文件夹

# ConfigSettingsDialog_ConfigFilePath.Text
source: Config file location
zh_cn: 配置文件位置

# ConfigSettingsDialog_ConfigFilePathDesc.Text
source: FolderRewind stores settings in this config.json
zh_cn: FolderRewind 会将设置写入此 config.json

# ConfigSettingsDialog_OpenConfigFolder.ToolTipService.ToolTip
source: Open config folder
zh_cn: 打开配置文件夹

# ConfigSettingsDialog_OpenConfigFile.ToolTipService.ToolTip
source: Open config.json
zh_cn: 打开 config.json

# ConfigSettingsDialog_Icon.Text
source: UI icon
zh_cn: 界面图标

# ConfigSettingsDialog_BackupMode.Header
source: Backup mode
zh_cn: 备份模式

# ConfigSettingsDialog_ModeFull.Content
source: Full (create new archive each time)
zh_cn: 全量备份 (每次生成新文件)

# ConfigSettingsDialog_ModeSmart.Content
source: Smart (changed files only)
zh_cn: Smart（仅备份变更文件）

# ConfigSettingsDialog_ModeRolling.Content
source: Rolling (create a new immutable archive from the current baseline)
zh_cn: Rolling（从当前基线创建新的不可变归档）

# ConfigSettingsDialog_RollingDescription
source: Rolling uses copy-on-write: the previous backup remains unchanged, while the new archive exactly reflects additions, modifications, and deletions. It falls back to Full when the baseline cannot be verified.
zh_cn: Rolling 使用写时复制：保留上一份备份不变，新归档精确反映新增、修改和删除。无法验证基线时会自动回退为 Full。

# ConfigSettingsDialog_Format.Header
source: Archive format
zh_cn: 压缩格式

# ConfigSettingsDialog_Format7z.Content
source: 7z (recommended)
zh_cn: 7z (推荐)

# ConfigSettingsDialog_FormatZip.Content
source: zip
zh_cn: zip (通用)

# ConfigSettingsDialog_CompressionLevel.Text
source: Compression level (0-9)
zh_cn: 压缩等级（0-9）

# ConfigSettingsDialog_KeepCount.Header
source: Keep recent backups (0 for unlimited)
zh_cn: 保留最近备份数（0 为不限制）

# ConfigSettingsDialog_Method.Header
source: Compression algorithm
zh_cn: 压缩算法

# ConfigSettingsDialog_SkipIfUnchanged.Header
source: Skip backup when unchanged
zh_cn: 无变更时跳过备份

# ConfigSettingsDialog_SkipIfUnchanged.OnContent
source: On
zh_cn: 开启

# ConfigSettingsDialog_SkipIfUnchanged.OffContent
source: Off
zh_cn: 关闭

# ConfigSettingsDialog_CpuThreads.Text
source: CPU threads
zh_cn: CPU 线程数

# ConfigSettingsDialog_CpuThreadsDescription
source: 0 means automatic. Device max: {0} threads.
zh_cn: 0 表示自动，当前设备最高 {0} 线程

# ConfigSettingsDialog_LowPriority.Header
source: Run compression tasks at low process priority
zh_cn: 以低进程优先级运行压缩任务

# ConfigSettingsDialog_LowPriority.OnContent
source: On
zh_cn: 开启

# ConfigSettingsDialog_LowPriority.OffContent
source: Off
zh_cn: 关闭

# ConfigSettingsDialog_LowPriorityDesc.Text
source: Only affects 7-Zip processes during backup. Reduces performance impact on games and other apps.
zh_cn: 仅影响备份时的 7-Zip 进程，可减少对游戏和前台应用的性能影响。

# ConfigSettingsDialog_PerformancePreset.Header
source: Performance impact
zh_cn: 性能影响

# ConfigSettingsDialog_PerformancePreset_Auto
source: Automatic
zh_cn: 自动

# ConfigSettingsDialog_PerformancePreset_Light
source: Light
zh_cn: 轻量

# ConfigSettingsDialog_PerformancePreset_VeryLight
source: Very light
zh_cn: 极轻量

# ConfigSettingsDialog_PerformancePreset_Custom
source: Custom
zh_cn: 自定义

# ConfigSettingsDialog_PerformancePresetDesc
source: Automatic keeps the current behavior. Use Light or Very light if backups make games or foreground apps feel slow.
zh_cn: 自动会保持当前行为。如果备份时游戏或前台应用明显卡顿，可以切换为轻量或极轻量。

# ConfigSettingsDialog_Additional7zArgs.Text
source: Additional 7-Zip arguments
zh_cn: 额外 7-Zip 参数

# ConfigSettingsDialog_Additional7zArgsDesc.Text
source: Appended only to backup compression commands. Arguments that override paths, format, password, filters, compression level, or CPU threads are blocked.
zh_cn: 仅追加到备份压缩命令。会阻止覆盖路径、格式、密码、过滤规则、压缩等级或 CPU 线程数的参数。

# ConfigSettingsDialog_Additional7zArgsInvalid
source: Additional 7-Zip arguments are invalid.
zh_cn: 额外 7-Zip 参数无效。

# ConfigSettingsDialog_Additional7zArgsSaveErrorTitle
source: Unsupported 7-Zip arguments
zh_cn: 不支持的 7-Zip 参数

# ConfigSettingsDialog_Additional7zArgsUnclosedQuote
source: Additional 7-Zip arguments contain an unclosed quote.
zh_cn: 额外 7-Zip 参数存在未闭合的引号。

# ConfigSettingsDialog_Additional7zArgsUnsupported
source: Unsupported 7-Zip argument: {0}
zh_cn: 不支持的 7-Zip 参数：{0}

# BackupService_Log_InvalidAdditional7zArgs
source: Invalid additional 7-Zip arguments: {0}
zh_cn: 额外 7-Zip 参数无效：{0}

# ConfigSettingsDialog_BackupBeforeRestore.Header
source: Backup before restore
zh_cn: 还原前自动备份

# ConfigSettingsDialog_BackupBeforeRestore.OnContent
source: On
zh_cn: 开启

# ConfigSettingsDialog_BackupBeforeRestore.OffContent
source: Off
zh_cn: 关闭

# ConfigSettingsDialog_SafeRestore.Header
source: Safe restore
zh_cn: 安全还原

# ConfigSettingsDialog_SafeRestore.OnContent
source: On — auto-rollback from a temporary copy on failure
zh_cn: 开启 — 失败时自动从临时副本回滚

# ConfigSettingsDialog_SafeRestore.OffContent
source: Off — restore failure may lose original files
zh_cn: 关闭 — 还原失败时可能丢失原文件

# BackupService_RestoreMissingBaseFull_Title
source: Complete restore base is missing
zh_cn: 无法找到完整还原基准

# BackupService_RestoreMissingBaseFull_Content
source: The Smart incremental backup "{0}" no longer has a usable full backup base, so precise Clean restore is unavailable. Continuing will use a compatibility fallback: reverse-overwrite from the newest backup to the target. This rolls back file versions but won't remove stale files. Continue?
zh_cn: 未能找到智能增量备份”{0}”对应的基础全量备份，精确安全还原已不可用。继续将改用兼容模式：从最新备份倒序覆写到目标备份。此方式可回退文件版本，但不会删除多余旧文件。是否继续？

# BackupService_RestoreMissingBaseFull_Primary
source: Continue fallback restore
zh_cn: 继续兼容还原

# ConfigSettingsDialog_VerifyArchiveBeforeRestore.Header
source: Verify backup integrity before restore
zh_cn: 还原前校验备份完整性

# ConfigSettingsDialog_VerifyArchiveBeforeRestore.OnContent
source: On — verify backup integrity before restoring
zh_cn: 开启 — 还原前先校验备份完整性

# ConfigSettingsDialog_VerifyArchiveBeforeRestore.OffContent
source: Off — skip verification
zh_cn: 关闭 — 跳过校验直接还原

# ConfigSettingsDialog_AutoBackup.Header
source: Enable auto backup
zh_cn: 启用自动备份

# ConfigSettingsDialog_RunOnAppStart.Content
source: Run when app starts
zh_cn: 应用启动时运行

# ConfigSettingsDialog_IntervalMode.Content
source: Interval backup mode
zh_cn: 间隔备份模式

# ConfigSettingsDialog_IntervalMinutes.Text
source: Run every
zh_cn: 周期运行间隔

# ConfigSettingsDialog_IntervalMinutesSuffix.Text
source: minutes
zh_cn: 分钟

# ConfigSettingsDialog_ScheduledMode.Content
source: Scheduled backup
zh_cn: 计划备份模式

# ConfigSettingsDialog_AutomationScope.Text
source: Automation scope
zh_cn: 自动化作用范围

# ConfigSettingsDialog_AutomationTargetFolder.Text
source: Target folder
zh_cn: 目标文件夹

# ConfigSettingsDialog_ConditionalMode.Content
source: Conditional backup mode
zh_cn: 条件备份模式

# ConfigSettingsDialog_ConditionalModeDesc.Text
source: Checks the specified relative-path file every 10 seconds. When the file changes from locked to unlocked, a backup is triggered, which works well for backing up saves after the game exits.
zh_cn: 固定每 10 秒检查一次指定相对路径文件。当文件从“被占用”变为“解除占用”时触发备份，适合在游戏存档退出后自动备份。

# ConfigSettingsDialog_ConditionRelativePath.Text
source: Condition file relative path
zh_cn: 条件文件相对路径

# ConfigSettingsDialog_ConditionRelativePathPlaceholder.PlaceholderText
source: For example: session.lock
zh_cn: 例如：session.lock

# ConfigSettingsDialog_Blacklist.Text
source: Exclusion list
zh_cn: 排除列表（不备份的文件/文件夹）

# ConfigSettingsDialog_BlacklistPlaceholder.PlaceholderText
source: Enter filename or path...
zh_cn: 输入文件名或路径...

# ConfigSettingsDialog_AddBlacklist.Content
source: Add
zh_cn: 添加

# ConfigSettingsDialog_UseRegex.Content
source: Treat blacklist entries as regex
zh_cn: 将黑名单项作为正则表达式

# ConfigSettingsDialog_RestoreWhitelist.Text
source: Restore whitelist
zh_cn: 还原白名单

# ConfigSettingsDialog_RestoreWhitelistDesc.Text
source: Files/folders not removed during Clean restore, protecting specific data from deletion.
zh_cn: 安全还原时不会清除的文件/文件夹，保护特定数据不被删除。

# ConfigSettingsDialog_RestoreWhitelistPlaceholder.PlaceholderText
source: Enter a filename, relative path, full path, or wildcard...
zh_cn: 输入文件名、相对路径、完整路径或通配符...

# ConfigSettingsDialog_AddRestoreWhitelist.Content
source: Add
zh_cn: 添加

# ConfigSettingsDialog_MaxSmartChain.Header
source: Smart backup chain length (0 = unlimited)
zh_cn: 智能备份链长度 (0 为不限制)

# ConfigSettingsDialog_MaxSmartChainDesc.Text
source: Start a new full backup after this many increments; applies to smart backups.
zh_cn: 达到此数量后重新生成完整备份，仅智能备份有效。

# BackupService_Log_SmartChainLimitReached
source: Incremental chain limit reached ({0}), forcing full backup
zh_cn: 增量备份链长度已达上限 ({0})，强制执行全量备份

# BackupService_Log_SmartChainCheckFailed
source: Smart chain length check failed: {0}
zh_cn: 智能备份链长度检查失败：{0}

# BackupService_Log_PrunedOldBackup
source: Pruned old backup: {0}
zh_cn: 已清理旧备份：{0}

# BackupService_Log_PruneDeleteFailed
source: Failed to prune backup {0}: {1}
zh_cn: 清理备份失败 {0}：{1}

# BackupService_Log_DependencyDeletionSkipped
source: Skipped deleting {0}: successor {1} still depends on it, and the legacy storage path cannot compact that dependency atomically without mutating committed data.
zh_cn: 已跳过删除 {0}：后继 {1} 仍依赖它，且旧存储路径无法完成不可变的原子压缩。

# SettingsPage_LogDiag.Text
source: Logs & diagnostics
zh_cn: 日志与诊断

# SettingsPage_CoreValidation.Text
source: Core feature validation
zh_cn: 核心功能自动校验

# SettingsPage_CoreValidationSectionDesc.Text
source: Automatically verify that backup and restore core flows work on this machine
zh_cn: 自动验证备份与还原核心流程是否能在当前电脑上正常工作

# SettingsPage_CoreValidation_Run.Text
source: Run full self-check
zh_cn: 执行完整自检

# SettingsPage_CoreValidation_RunDesc.Text
source: Create a temporary config and validate Smart backup, shared-lock files, restore, dependency-safe retention, and keep-count pruning
zh_cn: 自动创建临时配置并验证 Smart 备份、共享锁文件、还原、依赖安全保留与数量限制等关键行为

# SettingsPage_CoreValidation_RunButton.Content
source: Run validation
zh_cn: 立即校验

# SettingsPage_CoreValidation_ViewReportButton.Content
source: View current report
zh_cn: 查看本次报告

# SettingsPage_CoreValidation_State.Text
source: Status
zh_cn: 当前状态

# SettingsPage_CoreValidation_StateDesc.Text
source: Shows current state, latest run time, and the most recent summary
zh_cn: 展示运行状态、最近执行时间与最近一次摘要

# CoreValidation_Status_Idle
source: Core feature validation has not run yet
zh_cn: 尚未开始核心功能自动校验

# CoreValidation_Status_Preparing
source: Preparing core feature validation workspace
zh_cn: 正在准备核心功能自动校验环境

# CoreValidation_Status_Step
source: Running: {0}
zh_cn: 正在执行：{0}

# CoreValidation_Status_Succeeded
source: Core feature validation passed
zh_cn: 核心功能自动校验已通过

# CoreValidation_Status_Failed
source: Core feature validation failed
zh_cn: 核心功能自动校验失败

# CoreValidation_LastRun_None
source: Last run: never
zh_cn: 最近执行：尚未执行

# CoreValidation_LastRun_Value
source: Last run: {0}
zh_cn: 最近执行：{0}

# CoreValidation_LastSummary_None
source: Latest summary: none
zh_cn: 最近摘要：暂无

# CoreValidation_AlreadyRunning
source: Core feature validation is already running. Please wait for it to finish.
zh_cn: 核心功能自动校验正在进行中，请稍后再试。

# CoreValidation_AutoNotificationTitle
source: Core feature validation
zh_cn: 核心功能自动校验

# CoreValidation_Report_Title
source: Core feature validation report
zh_cn: 核心功能自动校验报告

# CoreValidation_Report_NoData
source: No validation report is available in the current session yet.
zh_cn: 当前会话还没有可查看的校验报告。

# CoreValidation_Report_Result
source: Result
zh_cn: 结果

# CoreValidation_Report_Result_Passed
source: Passed
zh_cn: 通过

# CoreValidation_Report_Result_Failed
source: Failed
zh_cn: 失败

# CoreValidation_Report_Mode
source: Mode
zh_cn: 执行方式

# CoreValidation_Report_Mode_Automatic
source: Automatic
zh_cn: 自动

# CoreValidation_Report_Mode_Manual
source: Manual
zh_cn: 手动

# CoreValidation_Report_Started
source: Started
zh_cn: 开始时间

# CoreValidation_Report_Finished
source: Finished
zh_cn: 结束时间

# CoreValidation_Report_Duration
source: Duration
zh_cn: 耗时

# CoreValidation_Report_Summary
source: Summary
zh_cn: 摘要

# CoreValidation_Summary_Passed
source: All core backup and restore checks passed.
zh_cn: 备份与还原核心功能自动校验全部通过。

# CoreValidation_Summary_Failed
source: Core backup and restore validation failed.
zh_cn: 备份与还原核心功能自动校验失败。

# CoreValidation_Step_PrepareWorkspace
source: Prepare temporary workspace
zh_cn: 准备临时校验环境

# CoreValidation_Step_InitialFullBackup
source: Initial full backup validation
zh_cn: 初始全量备份校验

# CoreValidation_Step_LegacyMetadataMigration
source: Legacy metadata lazy migration validation
zh_cn: 旧版元数据懒迁移校验

# CoreValidation_Step_NoChangeSkip
source: No-change skip validation
zh_cn: 无变化跳过校验

# CoreValidation_Step_SmartIncrementalBackup
source: Smart incremental backup validation
zh_cn: 智能增量备份校验

# CoreValidation_Step_SharedLockBackup
source: Shared-lock file backup validation
zh_cn: 共享锁文件备份校验

# CoreValidation_Step_DeletionOnlyBackup
source: Deletion-only backup validation
zh_cn: 仅删除变更备份校验

# CoreValidation_Step_CleanRestore
source: Clean restore validation
zh_cn: 安全还原校验

# CoreValidation_Step_OverwriteRestore
source: Overwrite restore validation
zh_cn: 覆写还原校验

# CoreValidation_Step_DependencyRetention
source: Dependency-safe retention validation
zh_cn: 依赖安全保留校验

# CoreValidation_Step_KeepCountPrune
source: Keep-count prune validation
zh_cn: 数量限制与自动清理校验

# CoreValidation_Step_FatalError
source: Fatal error
zh_cn: 致命错误

# SettingsPage_LogEnabled.Text
source: Enable file logging
zh_cn: 自动记录应用日志

# SettingsPage_LogEnabledDesc.Text
source: Write logs to local files for troubleshooting
zh_cn: 记录到本地文件供排查，可随时关闭

# SettingsPage_MaxLogSize.Text
source: Max log file size (MB)
zh_cn: 日志文件大小上限 (MB)

# SettingsPage_MaxLogSizeDesc.Text
source: Automatically rotate when exceeded
zh_cn: 超过上限后自动分卷留档

# SettingsPage_LogRetention.Text
source: Log retention days
zh_cn: 日志保留天数

# SettingsPage_LogRetentionDesc.Text
source: Automatically clean up old logs
zh_cn: 到期后自动清理历史日志

# SettingsPage_OpenLogCenter.Content
source: Open log center
zh_cn: 打开日志中心

# SettingsPage_Plugins.Text
source: Plugins
zh_cn: 插件

# SettingsPage_OpenPluginStore.Content
source: Open plugin store
zh_cn: 打开插件商店

# SettingsPage_ManualInstallPlugin.Content
source: Install .frplugin package
zh_cn: 安装 .frplugin 插件包

# SettingsPage_OpenPluginFolder.Content
source: Open plugin folder
zh_cn: 打开插件目录

# SettingsPage_RefreshPlugins.Content
source: Refresh
zh_cn: 刷新

# SettingsPage_RestartSafeMode.Content
source: Restart in Safe Mode
zh_cn: 以安全模式重启

# Plugins_RestartSafeModeTitle
source: Restart in Safe Mode?
zh_cn: 要以安全模式重启吗？

# Plugins_RestartSafeModeConfirm
source: FolderRewind will restart without loading plugin DLLs. Your enabled-plugin choices will not be changed.
zh_cn: FolderRewind 将在不加载任何插件 DLL 的情况下重启，且不会修改你的插件启用意图。

# Plugins_RestartSafeModeButton
source: Restart
zh_cn: 重启

# Plugins_RestartSafeModeFailed
source: Could not start Safe Mode: {0}
zh_cn: 无法启动安全模式：{0}

# SettingsPage_InstalledPlugins.Text
source: Installed plugins
zh_cn: 已安装插件

# SettingsPage_PluginSettings.Content
source: Settings
zh_cn: 设置

# SettingsPage_PluginUninstall.Content
source: Uninstall
zh_cn: 卸载

# SettingsPage_CheckPluginUpdates.Content
source: Check for updates
zh_cn: 检查更新

# SettingsPage_PluginsAutoCheckUpdates.Text
source: Auto-check for updates
zh_cn: 自动检查插件更新

# SettingsPage_PluginsAutoCheckUpdatesDesc.Text
source: Automatically check for plugin updates when the app starts
zh_cn: 启动时自动检查已安装插件的更新

# SettingsPage_Presets.Text
source: Starter presets
zh_cn: 入门预设

# SettingsPage_PresetsDesc.Text
source: Quick-start configurations for common scenarios, so you can get started faster.
zh_cn: 常见场景的快速入门配置集中在此，帮助你更快上手。

# SettingsPage_MinecraftPreset.Text
source: Minecraft starter preset
zh_cn: Minecraft 入门预设

# SettingsPage_MinecraftPresetDesc.Text
source: Install and enable the bundled MineRewind plugin, turn on KnotLink, and explain the remaining in-game integration steps.
zh_cn: 安装并启用随软件提供的 MineRewind 插件，开启 KnotLink，并说明后续游戏内集成步骤。

# SettingsPage_MinecraftPresetSteps.Text
source: The preset uses the verified bundled MineRewind package. An external KnotLink installer will not run until its immutable official URL and SHA-256 are curated.
zh_cn: 预设使用经过校验的内置 MineRewind 包。只有确定不可变的官方 URL 与 SHA-256 后，才会运行外部 KnotLink 安装器。

# SettingsPage_MinecraftPresetModReminder.Text
source: After this, install MineBackup-Mod for Minecraft to use in-game commands with FolderRewind.
zh_cn: 完成后还需要为 Minecraft 安装 MineBackup-Mod，才能在游戏内用指令调用存档时光机。

# SettingsPage_MinecraftPresetInstall.Content
source: Install preset
zh_cn: 一键安装

# SettingsPage_PluginDeleteData.Content
source: Delete data...
zh_cn: 删除数据...

# SettingsPage_CloudPreset.Text
source: Cloud backup starter preset
zh_cn: 云备份入门预设

# SettingsPage_CloudPresetDesc.Text
source: Prepare rclone automatically. Services such as Baidu Netdisk and Aliyun Drive also get OpenList and a guided setup path.
zh_cn: 自动准备 rclone；百度网盘、阿里云盘等服务会额外准备 OpenList，并打开配置引导。

# SettingsPage_CloudPresetSteps.Text
source: Choose a cloud service, then start setup. FolderRewind will download required tools, save the global rclone path, and open the cloud archive guide.
zh_cn: 选择云服务后开始配置。存档时光机会下载必要工具、写入全局 rclone 路径，并打开云存档文档。

# SettingsPage_CloudPresetStart.Content
source: Start setup
zh_cn: 开始配置

# SettingsPage_PluginUpdate.Content
source: Update
zh_cn: 更新

# SettingsPage_PluginUpdateText.Text
source: Version available: {0}
zh_cn: 新版本可用：{0}

# Plugins_UpdateTitle
source: Update plugin
zh_cn: 插件更新

# Plugins_UpdateConfirm
source: Update plugin {0} from {1} to {2}?
zh_cn: 确定要更新 {0} 从 {1} 到 {2} 吗？

# Plugins_UpdateButton
source: Update
zh_cn: 更新

# PluginStorePage_Title.Text
source: Plugin store
zh_cn: 插件商店

# PluginStorePage_Desc.Text
source: Browse the curated Official Catalog. Every .frplugin is verified against its Catalog SHA-256 and v3 Manifest before installation; newly installed plugins remain disabled.
zh_cn: 浏览经策展的官方目录。每个 .frplugin 在安装前都会核对目录 SHA-256 与 v3 Manifest；新安装插件保持禁用。

# PluginStorePage_RepoBox.Header
source: GitHub repo (owner/repo)
zh_cn: GitHub 仓库 (owner/repo)

# PluginStorePage_RepoBox.PlaceholderText
source: e.g. YourOrg/FolderRewind.Plugins
zh_cn: 例如：YourOrg/FolderRewind.Plugins

# PluginStorePage_Load.Content
source: Refresh Official Catalog
zh_cn: 刷新官方目录

# PluginStorePage_EmptyRepoHint.Text
source: No repository configured. Cannot load plugin assets.
zh_cn: 未配置仓库，无法加载插件列表。

# PluginStorePage_Install.Content
source: Install
zh_cn: 安装

# PluginStorePage_NoAssets.Text
source: No Official Catalog plugins are available. Installed plugins continue to work offline.
zh_cn: 官方目录当前没有可用插件；已安装插件离线时仍可继续使用。

# PluginStorePage_InstalledBadge.Text
source: Installed
zh_cn: 已安装

# PluginStorePage_InvalidRepo
source: Invalid repository format. Use owner/repo.
zh_cn: 仓库格式无效，请使用 owner/repo

# PluginStorePage_PluginSystemDisabled
source: Plugin system is disabled. Enable it in Settings first.
zh_cn: 插件系统已关闭，请先在设置页开启后再使用插件商店。

# LogPage_Title.Text
source: Logs
zh_cn: 日志

# LogPage_Subtitle.Text
source: View runtime logs and events
zh_cn: 查看运行日志与事件

# LogPage_Level_All.Content
source: All
zh_cn: 全部

# LogPage_Level_Info.Content
source: Info
zh_cn: 信息

# LogPage_Level_Warning.Content
source: Warning
zh_cn: 警告

# LogPage_Level_Error.Content
source: Error
zh_cn: 错误

# LogPage_Level_Debug.Content
source: Debug
zh_cn: 调试

# LogPage_SearchBox.PlaceholderText
source: Search logs
zh_cn: 搜索日志

# LogPage_LiveRefresh.Text
source: Live refresh
zh_cn: 实时刷新

# LogPage_AutoScroll.Text
source: Auto scroll
zh_cn: 自动滚动

# LogPage_CopySelected.Content
source: Copy
zh_cn: 复制

# LogPage_Clear.Content
source: Clear
zh_cn: 清空

# LogPage_OpenLogFolder.Content
source: Open log folder
zh_cn: 打开日志文件夹

# LogPage_BottomHint.Text
source: Tip: selecting nothing copies all entries
zh_cn: 提示：未选中任何项时会复制全部

# LogPage_OpenCurrentLogFile.Content
source: Open current log file
zh_cn: 打开当前日志文件

# LogLevel_Info
source: Info
zh_cn: 信息

# LogLevel_Warning
source: Warning
zh_cn: 警告

# LogLevel_Error
source: Error
zh_cn: 错误

# LogLevel_Debug
source: Debug
zh_cn: 调试

# Common_Ok
source: OK
zh_cn: 确定

# Common_Cancel
source: Cancel
zh_cn: 取消

# Common_Delete
source: Delete
zh_cn: 删除

# Common_Close
source: Close
zh_cn: 关闭

# Common_Done
source: Done
zh_cn: 完成

# Common_Failed
source: Failed
zh_cn: 失败

# Common_Canceled
source: Canceled
zh_cn: 已取消

# Plugins_StoreDialogTitle
source: Plugin store
zh_cn: 插件商店

# Plugins_UninstallTitle
source: Uninstall plugin
zh_cn: 卸载插件

# Plugins_UninstallConfirm
source: Uninstall plugin {0} ({1})? If plugin files are in use, you may need to close the app first.
zh_cn: 确定卸载插件 {0}（{1}）吗？ 如果插件文件被占用，可能需要关闭应用后再卸载。

# Plugins_UninstallButton
source: Uninstall
zh_cn: 卸载

# Plugins_SettingsTitle
source: Plugin settings
zh_cn: 插件设置

# Plugins_NoSettings
source: This plugin does not provide configurable settings.
zh_cn: 该插件未提供可配置项。

# PluginStore_InvalidItem
source: Invalid download item
zh_cn: 无效的下载项

# PluginStore_OnlyZipSupported
source: Only .zip plugin packages are supported (must contain manifest.json)
zh_cn: 当前仅支持 zip 插件包（需要包含 manifest.json）

# PluginStore_DownloadInstallFailed
source: Download/install failed: {0}
zh_cn: 下载/安装失败：{0}

# PluginStorePage_StatusDownloading
source: Downloading...
zh_cn: 下载中...

# PluginService_IncompatibleHostVersion
source: Requires host version {0}, current version is {1}
zh_cn: 需要 Host 版本 {0}，当前版本 {1}

# PluginService_VersionParseFailed
source: Version parse failed: {0}
zh_cn: 版本解析失败：{0}

# PluginService_PackageNotFound
source: Plugin package not found
zh_cn: 安装包不存在

# PluginService_MissingManifest
source: Plugin package is missing manifest.json
zh_cn: 安装包缺少 manifest.json

# PluginService_InvalidManifestNoId
source: Invalid manifest.json (missing Id)
zh_cn: manifest.json 无效（缺少 Id）

# PluginService_OverwriteFailed
source: Cannot overwrite (failed to delete old version): {0}
zh_cn: 无法覆盖安装（删除旧版本失败）：{0}

# PluginService_ZipSlip
source: Invalid package path (ZipSlip)
zh_cn: 安装包路径非法（ZipSlip）

# PluginService_InstallSuccessDisabled
source: Installed successfully (enable it in Settings)
zh_cn: 安装成功（可在设置中启用）

# PluginService_InstallFailed
source: Install failed: {0}
zh_cn: 安装失败：{0}

# PluginService_InstallPendingRestart
source: Plugin files are in use. Installation is queued and will complete on next app start.
zh_cn: 插件文件当前被占用，已排队在下次启动应用时完成安装。

# PluginService_QueueInstallPendingFailed
source: Plugin files are in use and a pending install task could not be created. Please restart app and try again.
zh_cn: 插件文件被占用，且无法创建待安装任务，请重启应用后重试。

# PluginService_EmptyPluginId
source: Plugin ID is empty
zh_cn: 插件 ID 为空

# PluginService_NotInstalled
source: Plugin is not installed
zh_cn: 插件未安装
